<template>
  <div class="warm-prompt">
    <public-header class="title" :headerTxt="$t('i18n.WARM_PROMPT')"></public-header>
    <div class="warm-content" ref="warmContent">
      <div class="ate">
      尊敬的玩家： 近期有部分玩家使用模式一二三加速时，出现 623错误提示。该问题主要原因是Windows 1803版本底层加速库字段和当前系统字段不一致导致，系统本身兼容性问题造成的。 工程师已迅速响应，迭代了最新版本客户端来解决这个问题，考虑到最新版本发布后仍需进行内测为了尽快解决您的问题，我们提供以下几种更为快速的临时方案： ①请尝试手动选择“模式四”进行加速; ②将自己的视窗系统暂时进行回滚; 以上 2个方案如若遇到新的问题，请通过官网咨询在线客服寻求帮助。 由此给您带来的不便敬请谅解！电脑系统更新总会带来无法避免的兼容性问题，我们力求第一时间发现问题并着手研究解决方案，未来还会探索更好的技术方案来应对类似问题。 感谢您的理解！
      尊敬的玩家： 近期有部分玩家使用模式一二三加速时，出现 623错误提示。该问题主要原因是Windows 1803版本底层加速库字段和当前系统字段不一致导致，系统本身兼容性问题造成的。 工程师已迅速响应，迭代了最新版本客户端来解决这个问题，考虑到最新版本发布后仍需进行内测为了尽快解决您的问题，我们提供以下几种更为快速的临时方案： ①请尝试手动选择“模式四”进行加速; ②将自己的视窗系统暂时进行回滚; 以上 2个方案如若遇到新的问题，请通过官网咨询在线客服寻求帮助。 由此给您带来的不便敬请谅解！电脑系统更新总会带来无法避免的兼容性问题，我们力求第一时间发现问题并着手研究解决方案，未来还会探索更好的技术方案来应对类似问题。 感谢您的理解！
      尊敬的玩家： 近期有部分玩家使用模式一二三加速时，出现 623错误提示。该问题主要原因是Windows 1803版本底层加速库字段和当前系统字段不一致导致，系统本身兼容性问题造成的。 工程师已迅速响应，迭代了最新版本客户端来解决这个问题，考虑到最新版本发布后仍需进行内测为了尽快解决您的问题，我们提供以下几种更为快速的临时方案： ①请尝试手动选择“模式四”进行加速; ②将自己的视窗系统暂时进行回滚; 以上 2个方案如若遇到新的问题，请通过官网咨询在线客服寻求帮助。 由此给您带来的不便敬请谅解！电脑系统更新总会带来无法避免的兼容性问题，我们力求第一时间发现问题并着手研究解决方案，未来还会探索更好的技术方案来应对类似问题。 感谢您的理解！
      尊敬的玩家： 近期有部分玩家使用模式一二三加速时，出现 623错误提示。该问题主要原因是Windows 1803版本底层加速库字段和当前系统字段不一致导致，系统本身兼容性问题造成的。 工程师已迅速响应，迭代了最新版本客户端来解决这个问题，考虑到最新版本发布后仍需进行内测为了尽快解决您的问题，我们提供以下几种更为快速的临时方案： ①请尝试手动选择“模式四”进行加速; ②将自己的视窗系统暂时进行回滚; 以上 2个方案如若遇到新的问题，请通过官网咨询在线客服寻求帮助。 由此给您带来的不便敬请谅解！电脑系统更新总会带来无法避免的兼容性问题，我们力求第一时间发现问题并着手研究解决方案，未来还会探索更好的技术方案来应对类似问题。 感谢您的理解！
      尊敬的玩家： 近期有部分玩家使用模式一二三加速时，出现 623错误提示。该问题主要原因是Windows 1803版本底层加速库字段和当前系统字段不一致导致，系统本身兼容性问题造成的。 工程师已迅速响应，迭代了最新版本客户端来解决这个问题，考虑到最新版本发布后仍需进行内测为了尽快解决您的问题，我们提供以下几种更为快速的临时方案： ①请尝试手动选择“模式四”进行加速; ②将自己的视窗系统暂时进行回滚; 以上 2个方案如若遇到新的问题，请通过官网咨询在线客服寻求帮助。 由此给您带来的不便敬请谅解！电脑系统更新总会带来无法避免的兼容性问题，我们力求第一时间发现问题并着手研究解决方案，未来还会探索更好的技术方案来应对类似问题。 感谢您的理解！
      尊敬的玩家： 近期有部分玩家使用模式一二三加速时，出现 623错误提示。该问题主要原因是Windows 1803版本底层加速库字段和当前系统字段不一致导致，系统本身兼容性问题造成的。 工程师已迅速响应，迭代了最新版本客户端来解决这个问题，考虑到最新版本发布后仍需进行内测为了尽快解决您的问题，我们提供以下几种更为快速的临时方案： ①请尝试手动选择“模式四”进行加速; ②将自己的视窗系统暂时进行回滚; 以上 2个方案如若遇到新的问题，请通过官网咨询在线客服寻求帮助。 由此给您带来的不便敬请谅解！电脑系统更新总会带来无法避免的兼容性问题，我们力求第一时间发现问题并着手研究解决方案，未来还会探索更好的技术方案来应对类似问题。 感谢您的理解！
      尊敬的玩家： 近期有部分玩家使用模式一二三加速时，出现 623错误提示。该问题主要原因是Windows 1803版本底层加速库字段和当前系统字段不一致导致，系统本身兼容性问题造成的。 工程师已迅速响应，迭代了最新版本客户端来解决这个问题，考虑到最新版本发布后仍需进行内测为了尽快解决您的问题，我们提供以下几种更为快速的临时方案： ①请尝试手动选择“模式四”进行加速; ②将自己的视窗系统暂时进行回滚; 以上 2个方案如若遇到新的问题，请通过官网咨询在线客服寻求帮助。 由此给您带来的不便敬请谅解！电脑系统更新总会带来无法避免的兼容性问题，我们力求第一时间发现问题并着手研究解决方案，未来还会探索更好的技术方案来应对类似问题。 感谢您的理解！
      尊敬的玩家： 近期有部分玩家使用模式一二三加速时，出现 623错误提示。该问题主要原因是Windows 1803版本底层加速库字段和当前系统字段不一致导致，系统本身兼容性问题造成的。 工程师已迅速响应，迭代了最新版本客户端来解决这个问题，考虑到最新版本发布后仍需进行内测为了尽快解决您的问题，我们提供以下几种更为快速的临时方案： ①请尝试手动选择“模式四”进行加速; ②将自己的视窗系统暂时进行回滚; 以上 2个方案如若遇到新的问题，请通过官网咨询在线客服寻求帮助。 由此给您带来的不便敬请谅解！电脑系统更新总会带来无法避免的兼容性问题，我们力求第一时间发现问题并着手研究解决方案，未来还会探索更好的技术方案来应对类似问题。 感谢您的理解！
      尊敬的玩家： 近期有部分玩家使用模式一二三加速时，出现 623错误提示。该问题主要原因是Windows 1803版本底层加速库字段和当前系统字段不一致导致，系统本身兼容性问题造成的。 工程师已迅速响应，迭代了最新版本客户端来解决这个问题，考虑到最新版本发布后仍需进行内测为了尽快解决您的问题，我们提供以下几种更为快速的临时方案： ①请尝试手动选择“模式四”进行加速; ②将自己的视窗系统暂时进行回滚; 以上 2个方案如若遇到新的问题，请通过官网咨询在线客服寻求帮助。 由此给您带来的不便敬请谅解！电脑系统更新总会带来无法避免的兼容性问题，我们力求第一时间发现问题并着手研究解决方案，未来还会探索更好的技术方案来应对类似问题。 感谢您的理解！
      尊敬的玩家： 近期有部分玩家使用模式一二三加速时，出现 623错误提示。该问题主要原因是Windows 1803版本底层加速库字段和当前系统字段不一致导致，系统本身兼容性问题造成的。 工程师已迅速响应，迭代了最新版本客户端来解决这个问题，考虑到最新版本发布后仍需进行内测为了尽快解决您的问题，我们提供以下几种更为快速的临时方案： ①请尝试手动选择“模式四”进行加速; ②将自己的视窗系统暂时进行回滚; 以上 2个方案如若遇到新的问题，请通过官网咨询在线客服寻求帮助。 由此给您带来的不便敬请谅解！电脑系统更新总会带来无法避免的兼容性问题，我们力求第一时间发现问题并着手研究解决方案，未来还会探索更好的技术方案来应对类似问题。 感谢您的理解！
      尊敬的玩家： 近期有部分玩家使用模式一二三加速时，出现 623错误提示。该问题主要原因是Windows 1803版本底层加速库字段和当前系统字段不一致导致，系统本身兼容性问题造成的。 工程师已迅速响应，迭代了最新版本客户端来解决这个问题，考虑到最新版本发布后仍需进行内测为了尽快解决您的问题，我们提供以下几种更为快速的临时方案： ①请尝试手动选择“模式四”进行加速; ②将自己的视窗系统暂时进行回滚; 以上 2个方案如若遇到新的问题，请通过官网咨询在线客服寻求帮助。 由此给您带来的不便敬请谅解！电脑系统更新总会带来无法避免的兼容性问题，我们力求第一时间发现问题并着手研究解决方案，未来还会探索更好的技术方案来应对类似问题。 感谢您的理解！
      </div>
    </div>
  </div>
</template>

<script>
import Bscroll from 'better-scroll'
import PublicHeader from '../../../common/components/public-header/public-header'
export default {
  name: 'WarmPrompt',
  mounted () {
    this.$nextTick(() => {
      this.scroll = new Bscroll(this.$refs.warmContent, {})
    })
  },
  components: {
    PublicHeader
  }
}
</script>

<style lang="scss" scoped>
@import '../../../common/scss/_utils';
.warm-prompt {
  width: 100%;
  height: 100vh;
  display: flex;
  flex-direction: column;
  .title {
    width: 100%;
    height: rem(112px);
    min-height: rem(112px);
    flex-shrink: 0;
  }
  .warm-content {
    padding: rem(40px);
    height: rem(1041px);
    font-size:rem(28px);
    color:rgba(58,56,72,1);
    line-height:rem(40px);
    overflow: auto;
    z-index: 20;
  }
  .ate {
    overflow: auto;
  }
}
</style>
